stm32-rs/stm32f4xx-hal/src/serial.rs
            fn set_stopbits(&self, bits: config::StopBits) {
                use crate::pac::usart1::cr2::STOP_A;
                use config::StopBits;

                self.cr2.write(|w| {
                    w.stop().variant(match bits {
                        StopBits::STOP0P5 => STOP_A::STOP0P5,
                        StopBits::STOP1 => STOP_A::STOP1,
                        StopBits::STOP1P5 => STOP_A::STOP1P5,
                        StopBits::STOP2 => STOP_A::STOP2,
                    })
                });
            }
        }

        impl<USART, TX, RX> Serial<USART, (TX, RX)>
        where
            TX: PinTx<USART>,
            RX: PinRx<USART>,
            USART: Instance,
        {
            #[deprecated(since = "0.10.0")]
            pub fn $usartX(
                usart: USART,
                pins: (TX, RX),
                config: config::Config,
                clocks: Clocks,
            ) -> Result<Self, config::InvalidConfig> {
                Self::new(usart, pins, config, clocks)
            }
        }
    };
}

// TODO: fix stm32f413 UARTs
#[cfg(any(
    feature = "uart4",
    feature = "uart5",
    feature = "uart7",
    feature = "uart8",
    feature = "uart9",
    feature = "uart10"
))]
#[cfg(not(any(feature = "stm32f413", feature = "stm32f423",)))]
macro_rules! halUart {
    ($USARTX:ty: ($usartX:ident, $pclkX:ident)) => {
        impl private::Sealed for $USARTX {}
        impl Instance for $USARTX {
            fn ptr() -> *const uart_base::RegisterBlock {
                <$USARTX>::ptr() as *const _
            }

            fn pclk_freq(clocks: &Clocks) -> u32 {
                clocks.$pclkX().0
            }

            fn set_stopbits(&self, bits: config::StopBits) {
                use crate::pac::uart4::cr2::STOP_A;
                use config::StopBits;

                self.cr2.write(|w| {
                    w.stop().variant(match bits {
                        StopBits::STOP0P5 => STOP_A::STOP1,
                        StopBits::STOP1 => STOP_A::STOP1,
                        StopBits::STOP1P5 => STOP_A::STOP2,
                        StopBits::STOP2 => STOP_A::STOP2,
                    })
                });
            }
        }

        impl<USART, PINS> Serial<USART, PINS>
        where
            PINS: Pins<USART>,
            USART: Instance,
        {
            #[deprecated(since = "0.10.0")]
            pub fn $usartX(
                usart: USART,
                pins: PINS,
                config: config::Config,
                clocks: Clocks,
            ) -> Result<Self, config::InvalidConfig> {
                Self::new(usart, pins, config, clocks)
            }
        }
    };
}

halUsart! { USART1: (usart1, pclk2) }
halUsart! { USART2: (usart2, pclk1) }
halUsart! { USART6: (usart6, pclk2) }

#[cfg(feature = "usart3")]
halUsart! { USART3: (usart3, pclk1) }

#[cfg(feature = "uart4")]
#[cfg(not(any(feature = "stm32f413", feature = "stm32f423")))]
halUart! { UART4: (uart4, pclk1) }
#[cfg(feature = "uart5")]
#[cfg(not(any(feature = "stm32f413", feature = "stm32f423")))]
halUart! { UART5: (uart5, pclk1) }

#[cfg(feature = "uart4")]
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
halUsart! { UART4: (uart4, pclk1) }
#[cfg(feature = "uart5")]
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
halUsart! { UART5: (uart5, pclk1) }

#[cfg(feature = "uart7")]
halUsart! { UART7: (uart7, pclk1) }
#[cfg(feature = "uart8")]
halUsart! { UART8: (uart8, pclk1) }
#[cfg(feature = "uart9")]
halUsart! { UART9: (uart9, pclk2) }
#[cfg(feature = "uart10")]
halUsart! { UART10: (uart10, pclk2) }

impl<USART, PINS> fmt::Write for Serial<USART, PINS>
where
    Serial<USART, PINS>: serial::Write<u8>,
{
    fn write_str(&mut self, s: &str) -> fmt::Result {
        s.bytes()
            .try_for_each(|c| block!(self.write(c)))
            .map_err(|_| fmt::Error)
    }
}

impl<USART> fmt::Write for Tx<USART>
where
    Tx<USART>: serial::Write<u8>,
{
    fn write_str(&mut self, s: &str) -> fmt::Result {
        s.bytes()
            .try_for_each(|c| block!(self.write(c)))
            .map_err(|_| fmt::Error)
    }
}
